In [1]:
! pip install ipython-sql

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: ipython-sql in c:\users\bilene.fas\appdata\roaming\python\python39\site-packages (0.5.0)
Requirement already satisfied: ipython in c:\program files\arcgis\pro\bin\python\envs\arcgispro-py3\lib\site-packages (from ipython-sql) (7.21.0)
Requirement already satisfied: ipython-genutils in c:\program files\arcgis\pro\bin\python\envs\arcgispro-py3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: prettytable in c:\users\bilene.fas\appdata\roaming\python\python39\site-packages (from ipython-sql) (3.6.0)
Requirement already satisfied: sqlparse in c:\users\bilene.fas\appdata\roaming\python\python39\site-packages (from ipython-sql) (0.4.3)
Requirement already satisfied: sqlalchemy>=2.0 in c:\users\bilene.fas\appdata\roaming\python\python39\site-packages (from ipython-sql) (2.0.7)
Requirement already satisfied: six in c:\program files\arcgis\pro\bin\python\envs\arcgispro-py3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\bilene.fas\appdata\roaming\python\python39\site-packages (from sqlalchemy>=2.0->ipython-sql) (2.0.2)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\users\bilene.fas\appdata\roaming\python\python39\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.5.0)
Requirement already satisfied: traitlets>=4.2 in c:\program files\arcgis\pro\bin\python\envs\arcgispro-py3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: pygments in c:\program files\arcgis\pro\bin\python\envs\arcgispro-py3\lib\site-packages (from ipython->ipython-sql) (2.9.0)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\program files\arcgis\pro\bin\python\envs\arcgispro-py3\lib\site-packages (from ipython->ipython-sql) (3.0.5)
Requirement already satisfied: colorama in c:\program files\arcgis\pro\bin\python\envs\arcgispro-py3\lib\site-packages (from ipython->ipython-sql) (0.4.4)
Requirement already satisfied: pickleshare in c:\program files\arcgis\pro\bin\python\envs\arcgispro-py3\lib\site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: jedi>=0.16 in c:\program files\arcgis\pro\bin\python\envs\arcgispro-py3\lib\site-packages (from ipython->ipython-sql) (0.18.0)
Requirement already satisfied: backcall in c:\program files\arcgis\pro\bin\python\envs\arcgispro-py3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: decorator in c:\program files\arcgis\pro\bin\python\envs\arcgispro-py3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: setuptools>=18.5 in c:\program files\arcgis\pro\bin\python\envs\arcgispro-py3\lib\site-packages (from ipython->ipython-sql) (60.10.0)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\program files\arcgis\pro\bin\python\envs\arcgispro-py3\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: wcwidth in c:\program files\arcgis\pro\bin\python\envs\arcgispro-py3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython->ipython-sql) (0.2.5)

In [3]:
%load_ext sql

In [8]:
%sql sqlite:///C:\Users\bilene\book.db

In [10]:
output = %sql SELECT pop FROM indicators0

 * sqlite:///C:\Users\bilene\book.db
Done.

In [13]:
import pandas as pd
pd.DataFrame(output,columns=['pop'])

       pop
0  1386.40
1    66.87
2    66.06
3  1338.66
4   325.15

In [18]:
%%sql 
output2 <<
SELECT pop 
FROM indicators0

 * sqlite:///C:\Users\bilene\book.db
Done.
Returning data to local variable output2

In [19]:
output2

[(1386.4,), (66.87,), (66.06,), (1338.66,), (325.15,)]

In [21]:
%%sql
SELECT name FROM topnames
LIMIT 5

 * sqlite:///C:\Users\bilene\book.db
Done.

[('Mary',), ('John',), ('Mary',), ('John',), ('Mary',)]

In [25]:
%%sql
SELECT year, name, sex FROM topnames
LIMIT 5

 * sqlite:///C:\Users\bilene\book.db
Done.

[(1880, 'Mary', 'Female'),
 (1880, 'John', 'Male'),
 (1881, 'Mary', 'Female'),
 (1881, 'John', 'Male'),
 (1882, 'Mary', 'Female')]

In [26]:
%%sql
SELECT year AS Year, name, sex FROM topnames
LIMIT 5

 * sqlite:///C:\Users\bilene\book.db
Done.

[(1880, 'Mary', 'Female'),
 (1880, 'John', 'Male'),
 (1881, 'Mary', 'Female'),
 (1881, 'John', 'Male'),
 (1882, 'Mary', 'Female')]

In [29]:
%%sql
SELECT * FROM topnames
LIMIT 5

 * sqlite:///C:\Users\bilene\book.db
Done.

[(1880, 'Female', 'Mary', 7065),
 (1880, 'Male', 'John', 9655),
 (1881, 'Female', 'Mary', 6919),
 (1881, 'Male', 'John', 8769),
 (1882, 'Female', 'Mary', 8148)]

In [36]:
%%sql
-- Here is a one line comment
/* Here is a multi line comment
 Another one */
    
-- The following returns all tables that exist
-- in the database
SELECT name FROM sqlite_master WHERE type='table'

 * sqlite:///C:\Users\bilene\book.db
Done.

[('countries',), ('indicators',), ('indicators0',), ('topnames',)]